Reports/АнализТоваровИПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>АнализТоваровИПоставщиков</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Documents/ЗаданиеАудитору.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЗаданиеАудитору</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаданийАудиторам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗаданийАудитору</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аудитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАудита</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторнаяДатаАудита</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маркер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МаркерыДляАудита</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАудитаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторнаяДатаАудитаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПриложенныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайлаСРасширением</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комментарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.ПерсоналККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/АнализТоваровИПоставщиков/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.Периодичность = "По неделям";
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураРасшифровки = Расшифровать(Расшифровка);
	
	Если Не ЗначениеЗаполнено(СтруктураРасшифровки.Товар)
		И НЕ ЗначениеЗаполнено(СтруктураРасшифровки.Поставщик) Тогда
		Возврат;
	КонецЕсли;
	
	СписокЗначений = Новый СписокЗначений();
	СписокЗначений.Добавить("Расшифровать жалобы");
	СписокЗначений.Добавить("Расшифровать включения");
	СписокЗначений.Добавить("Расшифровать нарушения в лабораторных протоколах");
	Если ЗначениеЗаполнено(СтруктураРасшифровки.Поставщик) Тогда
		СписокЗначений.Добавить("Расшифровать маркер аудита");
	КонецЕсли;	
	
	ВыбранныйЭлемент = СписокЗначений.ВыбратьЭлемент();
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Если ВыбранныйЭлемент.Значение = "Расшифровать жалобы" Тогда
			СтруктураРасшифровки.Вставить("Тип", "Жалобы");
			ОткрытьФорму("Отчет.АнализТоваровИПоставщиков.Форма.ФормаРасшифровка", СтруктураРасшифровки);
		ИначеЕсли ВыбранныйЭлемент.Значение = "Расшифровать включения" Тогда
			СтруктураРасшифровки.Вставить("Тип", "Включения");
			ОткрытьФорму("Отчет.АнализТоваровИПоставщиков.Форма.ФормаРасшифровка", СтруктураРасшифровки);	
		ИначеЕсли ВыбранныйЭлемент.Значение = "Расшифровать нарушения в лабораторных протоколах" Тогда
			СтруктураРасшифровки.Вставить("Тип", "Нарушения");
			ОткрытьФорму("Отчет.АнализТоваровИПоставщиков.Форма.ФормаРасшифровка", СтруктураРасшифровки);
		ИначеЕсли ВыбранныйЭлемент.Значение = "Расшифровать маркер аудита" Тогда
			Док = ПолучитьРасшифровкуМаркера(СтруктураРасшифровки.Поставщик);
			Если ЗначениеЗаполнено(Док) Тогда
				ОткрытьЗначение(Док);
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьРасшифровкуМаркера(Производитель)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Производитель", Производитель);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВЗ_Макс.Производитель КАК Производитель,
	               |			МАКСИМУМ(ЗаданиеАудитору.Маркер) КАК Маркер,
	               |			ЗаданиеАудитору.Ссылка КАК Ссылка
	               |		ИЗ
	               |			(ВЫБРАТЬ
	               |				МАКСИМУМ(ЗаданиеАудитору.ДатаАудита) КАК ДатаАудита,
	               |				ЗаданиеАудитору.Производитель КАК Производитель
	               |			ИЗ
	               |				Документ.ЗаданиеАудитору КАК ЗаданиеАудитору
	               |			ГДЕ
	               |				ЗаданиеАудитору.ПометкаУдаления = Ложь
	               |				И ЗаданиеАудитору.ДатаАудита > ДАТАВРЕМЯ(1, 1, 1)
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				ЗаданиеАудитору.Производитель) КАК ВЗ_Макс
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеАудитору КАК ЗаданиеАудитору
	               |				ПО ВЗ_Макс.ДатаАудита = ЗаданиеАудитору.ДатаАудита
	               |					И ВЗ_Макс.Производитель = ЗаданиеАудитору.Производитель
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ВЗ_Макс.Производитель,
	               |			ЗаданиеАудитору.Ссылка) КАК ВложенныйЗапрос
	               |		ПО Контрагенты.Ссылка = ВложенныйЗапрос.Производитель
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА Контрагенты.ГоловнойКонтрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |				ТОГДА Контрагенты.ГоловнойКонтрагент
	               |			ИНАЧЕ Контрагенты.Ссылка
	               |		КОНЕЦ = &Производитель";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе	
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции	

&НаСервере
Функция Расшифровать(Расшифровка)
	
	Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	
	СтруктураПараметры = Новый Структура("ДатаНач, ДатаКон, Товар, Поставщик");
	
	ПоляРасшифровки = ТиповыеОтчеты.ПолучитьМассивПолейРасшифровки(Расшифровка, Данные);
	
	ДатаРасшифровки = '00010101';
	Поставщик = Неопределено;
	Товар = Неопределено;
	Для Каждого ЭлементРасшифровка Из ПоляРасшифровки Цикл
		Если ТипЗнч(ЭлементРасшифровка) = Тип("ЗначениеПоляРасшифровкиКомпоновкиДанных") Тогда
			Если НРег(ЭлементРасшифровка.Поле) = "дата" Тогда
				ДатаРасшифровки = ЭлементРасшифровка.Значение;
			ИначеЕсли НРег(ЭлементРасшифровка.Поле) = "товар" Тогда
				СтруктураПараметры.Товар = ЭлементРасшифровка.Значение;
			ИначеЕсли НРег(ЭлементРасшифровка.Поле) = "поставщик" Тогда
				СтруктураПараметры.Поставщик = ЭлементРасшифровка.Значение;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
	Если Отчет.Периодичность = "По неделям" Тогда
		СтруктураПараметры.ДатаНач = ДатаРасшифровки;
		СтруктураПараметры.ДатаКон = КонецНедели(ДатаРасшифровки);
	Иначе
		СтруктураПараметры.ДатаНач = ДатаРасшифровки;
		СтруктураПараметры.ДатаКон = КонецМесяца(ДатаРасшифровки);
	КонецЕсли;	
	
	Возврат СтруктураПараметры;	
КонецФункции
